/* 1. Створити БД на тему - "Бібліотека".
2. Створити таблицю "книжка" з полями(
- назва книги(не null, до 120 символів),
- опис(встановити default значення "Опис відсутній"),
- дата публікації(не null, default значення "2018-01-01"),
- автор(не null, до 60 символів),
- категорія(не null, до 30 символів)
3. Добавити в цю таблицю 10 записів.*/
drop database library;
create database library character set utf8 collate utf8_general_ci;
use library;
create table book (book_name char(120) not null
    ,book_description char(120) default"notpresent" ,
                   date_of_publication date default"2018-01-01",
                   author char(60) not null,category char(30) not null);
insert into book (book_name,author,category) values ("Колобок","Народ","Сказки"),
                                                    ("Тарас Бульба","Гоголь","Драма"),
                                                    ("Лабиринт Отражений", "Лукяненко","Киберпанк"),
                                                    ("Нейромант","Гибсон","Киберпанк"),
                                                    ("Венецианский Купец","Шекспир","Класика"),
                                                    ("Браття Карамазовы","Достоевский","Класика"),
                                                    ("Особова справа","Эдвард Сноуден","Биография"),
                                                    ("Титан","Теодор Драйзер","Роман"),
                                                    ("Сияние ","Стивен кинг","Хорор"),
                                                    ("Государь","Макиваелли","Класика");